[
  {
    "title": "Website Development in Patna",
    "slug": "website-development-patna",
    "date": "2025-06-04",
    "summary": "Learn how to create a professional website for your business in Patna with FTech Global.",
    "image": "images/blog1.jpg",
    "content": "Website development is the foundation of your online business. At FTech Global, we offer fast, SEO-friendly websites for startups and SMEs in Bihar."
  },
  {
    "title": "GST Registration Guide for Startups",
    "slug": "gst-registration-guide",
    "date": "2025-06-02",
    "summary": "Step-by-step guide to register your business under GST in India.",
    "image": "images/blog2.jpg",
    "content": "Registering for GST is essential for every growing business. FTech Global helps businesses file for GST easily with expert guidance and quick processing."
  },
  {
    "title": "Top Digital Marketing Strategies for 2025",
    "slug": "digital-marketing-2025",
    "date": "2025-06-01",
    "summary": "Boost your brand visibility and sales with these proven digital marketing tips.",
    "image": "images/blog3.jpg",
    "content": "In 2025, content marketing, reels, SEO, and WhatsApp automation are key strategies. Learn how to implement them for your business."
  },
  {
    "title": "How to File ITR for Small Businesses",
    "slug": "itr-filing-small-business",
    "date": "2025-05-30",
    "summary": "Know the process and documents required to file your Income Tax Return as a small business.",
    "image": "images/blog4.jpg",
    "content": "Filing ITR helps you stay compliant and build financial credibility. At FTech Global, we assist in accurate and timely ITR filing for entrepreneurs."
  },
  {
    "title": "Why Every Business Needs a Google Business Profile",
    "slug": "google-business-profile-benefits",
    "date": "2025-05-28",
    "summary": "Google My Business listing boosts your online presence and helps customers find you easily.",
    "image": "images/blog5.jpg",
    "content": "With a Google Business Profile, your company appears on maps, search results, and helps build trust. FTech Global sets it up professionally for your brand."
  }
]
